tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "exolnet/homebrew-deprecated"

# Core packages
brew "pkg-config"
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "rsync"
brew "git"
brew "vim"
brew "wget"
brew "pwgen"
brew "zsh"
brew "mas"
brew "wp-cli"

# Development environment
brew "httpd", restart_service: true
brew "mysql@5.7", restart_service: true, link: true
# brew "php@7.0"
brew "php@7.1", link: false
brew "php@7.2", link: false
brew "php@7.3", link: false
brew "php@7.4", restart_service: true, link: true
brew "php@8.0", link: false
brew "dnsmasq", restart_service: true
brew "composer"

# Image related
brew "jpeg"
brew "imagemagick"
brew "jpegoptim"
brew "pngcrush"
brew "pngquant"
brew "optipng"

# Node related
brew "nave"
brew "yarn", args: ["without-node"]

# Apps - see: https://formulae.brew.sh/cask/
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "local"
cask "tableplus" 
cask "kaleidoscope"
cask "firefox"
cask "google-chrome"
cask "skype"
cask "discord"
cask "cozy-drive"
cask "spotify"
cask "imageoptim"
cask "handbrake"
cask "spectacle"
cask "typora"
cask "pika"

mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
