tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "exolnet/homebrew-deprecated"

# Core packages
brew "pkg-config"
brew "bash"
brew "coreutils"
brew "findutils"
brew "grep"
brew "rsync"
brew "git"
brew "wget"
brew "pwgen"
brew "zsh"
brew "mas"
brew "wp-cli"

# Development environment
# brew "php@7.0"
# brew "php@7.1", link: false
# brew "php@7.2", link: false
brew "php@7.3", link: false
brew "php@7.4", restart_service: true, link: true
brew "php@8.0", link: false
brew "composer"
# brew "httpd", restart_service: true
# brew "mysql@5.7", restart_service: true, link: true
# brew "dnsmasq", restart_service: true

# Image related
brew "jpeg"
brew "imagemagick"
brew "jpegoptim"
brew "pngcrush"
brew "pngquant"
brew "optipng"

# Node related
brew "nave"
brew "yarn", args: ["ignore-dependencies"]

# Apps - see: https://formulae.brew.sh/cask/
cask "bitwarden"
cask "cyberduck"
cask "discord"
cask "docker"
cask "gas-mask"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "keka"
cask "local"
cask "microsoft-edge"
cask "pika"
cask "poedit"
cask "sequel-ace"
cask "spark"
cask "spotify"
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "notion"
cask "pika"

mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825